# AssemblyInvalidMember Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..AssemblyInvalidMember Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
Some elements became ineligible to be included in an assembly and were removed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AssemblyInvalidMember { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AssemblyInvalidMember As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AssemblyInvalidMember {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace